{
    "Week 06: Group Project": "All group members MUST contribute. Break up the development work for this assignment so that each group member is assigned a task.\n\nPlease perform the following tasks:\n\n1. HTML (Page Structure): Web Storefront - Shopper Management (handles the new/update shopper details form)\n2. CSS (Page Style and Cosmetics): Web Storefront - Shopper Management\n3. Bootstrap (Professional Look): Web Storefront - Shopper Management\n4. JavaScript (Page Behaviors and Field Integrity Checks): Shopper Management Page\n5. JSON: Shopper Document Collection (containing the details from the new/update shopper details form)\n\nShopper details should include:\n- Email address (required)\n- Name (required)\n- Contact phone number (optional)\n- Age (required)\n- Address (required)",
    
    "Week 07: Group Work Project": "Please perform the following tasks as your group:\n\n1. HTML (Page Structure): Web Storefront - Product Management (handles the new/update product details form)\n2. CSS (Page Style and Cosmetics): Web Storefront - Product Management Web Page\n3. Bootstrap (Professional Look): Web Storefront - Product Management Web Page\n4. JavaScript (Page Behaviors and Field Integrity Checks): Product Management Web Page\n5. JSON: Product Document Collection for the Product Management Page\n6. jQuery: Search and update the JSON product document\n\nProduct details should include:\n- Product Id (required)\n- Product Description (required)\n- Product Category (required)\n- Product Unit of Measure (required)\n- Product Price (required)\n- Product Weight (optional)",
  
    "Week 08: Group Work Project Alpha Web Storefront": "All group members MUST contribute. If your name does not appear on the cover page or in the document section, you will receive a zero for this assignment. Break up the development work so that each member is assigned a task. Each section of the PDF document must show the team member author. Include all coding and screenshots of the rendered web pages.\n\nPlease perform the following tasks:\n\n1. HTML (Page Structure): Web Storefront - Shopping Cart (handles searching, adding, and removing products)\n2. CSS (Page Style and Cosmetics): Shopping Cart Web Page\n3. Bootstrap (Professional look) Web Storefront: Shopping Cart Web Page\n4. JavaScript (page behaviors and field integrity checks) Web Storefront: Shopping Cart Web Page\n5. JSON Product Document (containing the details from the new/update product details form): the Shopping Cart Web Page\n6. jQuery (Search the product document collection for items to add to the shopping cart) Web Storefront: Shopping Cart Web Page\n7. AJAX (transport the JSON document collection to a restful service API service) Web Storefront: Shopping Cart Web Page",
  
    "Week 09: Group Work Project Alpha Web Storefront": "All group members MUST contribute. If your name does not appear on the cover page or in the document section, you will receive a zero for this assignment. Break up the development work so that each member is assigned a task. Each section of the PDF document must show the team member author. Include all coding and screenshots of the rendered web pages.\n\nPlease perform the following tasks:\n\n1. HTML (Page Structure) Web Storefront: Shipping Selection (will handle the order shipping details selection - shipping destination, shipping carrier, and shipping method) Web Page\n2. CSS (Page Style and Cosmetics) Web Storefront: Shipping Selection Web Page\n3. Bootstrap (Professional look) Web Storefront: Shipping Selection Web Page\n4. JavaScript (page behaviors and field integrity checks on the form) Web Storefront: Shipping Selection Web Page\n5. JSON Product Document (containing the details from the shipping selection form): the Shopping Cart Web Page\n6. jQuery (Search the product document collection for items to add to the shopping cart) Web Storefront: Shopping Cart Web Page\n7. AJAX (transport the JSON document collection to a restful service API service) Web Storefront: Shopping Cart Web Page\n8. AngularJS (call the restful services to handle send the JSON document collections: shopper, products, shopping cart).Shipping details: shipping destination address, shipping carrier, and shipping method"
  }